[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/ZMcxWrn/The-Great-Gatsby.png",
    "review": "A timeless classic depicting the extravagant yet tumultuous era of the roaring twenties. With rich prose, Fitzgerald intricately weaves themes of love, wealth, and the elusive American Dream into a captivating narrative. The characters' pursuits and failures mirror the era's essence, resonating with readers across generations. The Great Gatsby remains a poignant reflection on the allure and disillusionment of the Jazz Age, leaving an indelible mark on literature.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Romance", "Tragedy"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/tLQvWXx/1984.jpg",
    "review": "A dystopian masterpiece, Orwell's '1984' serves as a chilling warning against totalitarianism and the erosion of individual freedoms. Set in a surveillance society, the novel depicts a bleak future where truth is subjective and obedience is enforced. Through vivid prose, Orwell explores the psychological and sociopolitical ramifications of unchecked power. '1984' remains a seminal work, its themes of censorship and oppression resonating in contemporary discourse on government overreach and surveillance.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Dystopian", "Political"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 3,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/f0t4YqN/To-Kill-a-Mockingbird.jpg",
    "review": "Harper Lee's 'To Kill a Mockingbird' stands as a poignant indictment of racial injustice and a testament to the enduring power of empathy. Set in the racially charged American South, the novel follows young Scout Finch's journey as she witnesses her father, Atticus, defend a black man falsely accused of rape. Through Scout's innocent perspective, Lee navigates themes of morality, compassion, and the complexities of human nature, creating an enduring masterpiece that resonates with readers of all ages.",
    "totalPages": 324,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Classic","Coming-of-Age"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 4,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/2ShPb0D/The-Catcher-in-the-Rye.jpg",
    "review": "J.D. Salinger's 'The Catcher in the Rye' remains an enduring portrayal of teenage angst and alienation. Narrated by disillusioned teenager Holden Caulfield, the novel navigates themes of identity, belonging, and the loss of innocence. Through Caulfield's introspective journey in the bustling streets of New York City, Salinger captures the complexities of adolescence with unparalleled authenticity. 'The Catcher in the Rye' continues to resonate with readers, offering a timeless exploration of the human condition.",
    "totalPages": 277,
    "rating": 4.4,
    "category": "Fiction",
    "tags": ["Classic", "Coming-of-Age"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 5,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/9N6LbcW/The-Hobbit.jpg",
    "review": "J.R.R. Tolkien's 'The Hobbit' enchants readers with its timeless tale of adventure and heroism. Set in the enchanting realm of Middle-earth, the novel follows the humble hobbit Bilbo Baggins on a grand quest to reclaim treasure guarded by the fearsome dragon Smaug. Alongside a band of dwarves and the wise wizard Gandalf, Bilbo discovers courage, friendship, and the true meaning of heroism. 'The Hobbit' captivates with its rich mythology and enduring themes of bravery and self-discovery.",
    "totalPages": 310,
    "rating": 4.6,
    "category": "Fantasy",
    "tags": ["Epic", "Quest"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 6,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/hLbCnPZ/Pride-and-Prejudice.jpg",
    "review": "Jane Austen's 'Pride and Prejudice' remains a timeless romance, exploring the complexities of love, society, and the human heart. Set in the genteel world of Regency-era England, the novel follows the spirited Elizabeth Bennet as she navigates social conventions, familial expectations, and her own prejudices. Through sharp wit and keen observation, Austen crafts a story of enduring love and self-discovery that continues to captivate readers with its universal themes and unforgettable characters.",
    "totalPages": 279,
    "rating": 4.9,
    "category": "Fiction",
    "tags": ["Romance", "Classic"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  }
]
